Repository: DlangRen/Programming-in-D
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: $(DERS_BOLUMU $(IX user defined attributes) $(IX UDA) User Defined Attributes (UDA))
zh_cn: $(DERS_BOLUMU $(IX user defined attributes) $(IX UDA) 自定义属性（UDA）)

source: $(P Any declaration (e.g. struct type, class type, variable, etc.) can be assigned attributes, which can then be accessed at compile time to alter the way the code is compiled.
zh_cn: $(P 所有声明（如结构、类和变量等）都可以加上属性，以便在编译时访问这些属性来调整该部分代码的编译方式。

source: $(UL $(LI $(LINK2 $(ROOT_DIR)/ders/d/, $(IMG bullet_black.png) This book in Turkish)) $(LI $(LINK2 mailto:acehreli@yahoo.com, $(IMG bullet_black.png) Contact)) $(BR) $(LI $(LINK2 $(ROOT_DIR)/copyright.html, $(IMG cc_80x15.png) Rights)) )
zh_cn: 土耳其语版$(UL $(LI $(LINK2 $(ROOT_DIR)/ders/d/, $(IMG bullet_black.png) 土耳其语版)) $(LI $(LINK2 mailto:acehreli@yahoo.com, $(IMG bullet_black.png) 联系方式)) $(BR) $(LI $(LINK2 $(ROOT_DIR)/copyright.html, $(IMG cc_80x15.png) 版权)) )

source: COZUM_METIN=the solution COZUMLER_METIN=the solutions
zh_cn: COZUM_METIN=解答 COZUMLER_METIN=解答

source: DERLEME_HATASI_METIN=compilation ERROR
zh_cn: DERLEME_HATASI_METIN=编译出错

source: DUSEY_NAVIGASYON= <div class="vertinavheader">Other D Resources</div> $(UL $(LI $(LINK2 http://wiki.dlang.org/Books, $(IMG bullet_black.png) Books)) $(LI $(LINK2 http://forum.dlang.org/, $(IMG bullet_black.png) Newsgroups)) $(LI $(LINK2 http://dlang.org/lex.html, $(IMG bullet_black.png) Language spec)) $(LI $(LINK2 http://dlang.org/phobos/index.html, $(IMG bullet_black.png) Standard library)) )
zh_cn: DUSEY_NAVIGASYON= <div class="vertinavheader">其他D语言资源</div> $(UL $(LI $(LINK2 http://wiki.dlang.org/Books, $(IMG bullet_black.png) 书籍)) $(LI $(LINK2 http://forum.dlang.org/, $(IMG bullet_black.png) 社区)) $(LI $(LINK2 http://dlang.org/lex.html, $(IMG bullet_black.png) 语言规范)) $(LI $(LINK2 http://dlang.org/phobos/index.html, $(IMG bullet_black.png) 标准库)) )

source: GERI_METIN=Prev ILERI_METIN=Next PROBLEM_METIN=Exercise PROBLEM_COK_METIN=Exercises PROBLEM_TEK_COZUMSUZ_METIN=the solution will be posted later...
zh_cn: GERI_METIN=上一章 ILERI_METIN=下一章 PROBLEM_METIN=练习 PROBLEM_COK_METIN=练习 PROBLEM_TEK_COZUMSUZ_METIN=答案将随后公布……

source: MAIN_TITLE=D.ershane Solutions CLASS=solution COZUM_BOLUMU = $(H4 $0) LANG=en LANGUAGE=english SUB_AUTHOR=
zh_cn: MAIN_TITLE=D 语言解答 CLASS=solution COZUM_BOLUMU = $(H4 $0) LANG=en LANGUAGE=english SUB_AUTHOR=

source: MAIN_TITLE=Programming in D SUB_MAIN_TITLE_DERSE_OZEL=– Tutorial and Reference SUB_AUTHOR=Ali Çehreli LANG=en LANGUAGE=english
zh_cn: MAIN_TITLE=D 编程语言 SUB_MAIN_TITLE_DERSE_OZEL=——教程与参考 SUB_AUTHOR=Ali Çehreli LANG=en LANGUAGE=english

source: PROBLEM_COK_COZUMSUZ_METIN=the solutions will be posted later...
zh_cn: PROBLEM_COK_COZUMSUZ_METIN=答案将随后公布……
